# Grouping

Pada 'group by' akan memungkinkan kita untuk mencapai hal di bawah ini:
- Menerapkan fungsi agregasi ke setiap grup secara mandiri
- Berdasarkan beberapa kriteria, bagi data menjadi beberapa kelompok
- Menggabungkan hasil 'group by' ke dalam struktur data

In [12]:
import pandas as pd
pd.__version__

'2.2.2'

In [13]:
import numpy as np
np.__version__

'1.24.3'

In [14]:
df = pd.DataFrame({
  'Name' : ['Jack', 'Jane', 'Jack', 'Jane', 'Jack', 'Jane', 'Jack', 'Jane'],
  'State' : ['SFO', 'SFO', 'NYK', 'CA', 'NYK', 'NYK', 'SFO', 'CA'],
  'Grade' : ['A', 'A', 'B', 'A', 'C', 'B', 'C', 'A'],
  'Age' : np.random.uniform(24, 50, size=8),
  'Salary' : np.random.uniform(3000, 5000, size=8)
})
df


# perhatikan bahwa kolom diurutkan secara otomatis dalam urutan abjadnya
# untuk pesanan khusus gunakan kode di bawah ini
# df = pd.DataFrame(data, colums= ['name', 'state', 'age', 'salary'])

   Name State Grade        Age       Salary
0  Jack   SFO     A  34.132594  3326.346561
1  Jane   SFO     A  43.347119  4049.003039
2  Jack   NYK     B  36.852219  4881.535442
3  Jane    CA     A  24.414836  3447.341356
4  Jack   NYK     C  41.603756  3428.137343
5  Jane   NYK     B  43.796303  4165.191623
6  Jack   SFO     C  38.426526  4327.608342
7  Jane    CA     A  45.624255  3890.975248

In [18]:
# grouping
df.groupby('Name').sum()

             State Grade         Age        Salary
Name
Jack  SFONYKNYKSFO  ABCC  151.015095  15963.627688
Jane    SFOCANYKCA  AABA  157.182513  15552.511267

In [22]:
# temukan usia dan gaji maksimal berdasarkan Nama / Negara
# Anda dapat menggunakan semua fungsi agregat seperti min, max, mean, count, cumsum

df.groupby(['Name', 'State']).max()

           Grade        Age       Salary
Name State
Jack NYK       C  41.603756  4881.535442
     SFO       C  38.426526  4327.608342
Jane CA        A  45.624255  3890.975248
     NYK       B  43.796303  4165.191623
     SFO       A  43.347119  4049.003039